Repository: Nikita-080/The-Elder-Evil-Era
Catalog: translations/*/LC_MESSAGES/The-Elder-Evil-Era.po
Languages: ru

source: Heavy warrior
ru: Тяжелый воин

source: At all times, the order has remained a community of elite soldiers. Even a low-ranking fighter is clad in full plate armor and armed with an elaborately crafted blade. Before their first battle, warriors spend thousands of hours in training halls and can compete in the military craft even with enemy veterans.
ru: Во все времена орден оставался сообществом элитных солдат. Даже боец низшего ранга облачен в полный латный доспех и вооружен искусно сделанным клинком. Перед своей первой битвой воины проводят тысячи часов в тренировочных залах и могут посоперничать в военном ремесле даже с ветеранами противника.

source: These mighty heroes were created to crush the biggest and most dangerous fiends of dark magic. Their armor can withstand almost anything. They are the striking force of the order. They are death. They are retribution.
ru: Эти могучие герои созданы для сокрушения самых больших и опасных исчадий темной магии. Их броня может выдержать почти все. Они - ударная сила ордена. Они - смерть. Они - возмездие.

source: Shadow warrior
ru: Теневой воин

source: void wave
ru: волна пустоты

source: spear
ru: копьё

source: Horse warrior
ru: Конный воин

source: The horsemen of the Order. Even the proud people of the clan treat them with silent respect. With their long spear, they deliver a single fatal blow. It can also serve as a throwing weapon.
ru: Всадники ордена. Даже гордые люди клана относятся к ним с молчаливым уважением. Своим длинным копьем они наносят единственный смертельный удар. Оно же может служить метательным оружием.

source: Shadow Warriors earned their name for a reason. They comprehend fundamental and dangerous forces in solitude. They avoid other members of the order, say almost nothing, and move within the walls of the citadel almost silently, like shadows. There are fears that this is how they restrain the spread of some otherworldly filth. Anyway, shadow warriors are the only thing that the order can put up against mystical creatures.
ru: Теневые воины заслужили свое название не просто так. Они постигают фундаментальные и опасные силы в уединении. Они избегают других служителей ордена, почти ничего не говорят и передвигаются в стенах цитадели почти бесшумно, словно тени. Есть опасения, что так они сдерживают распространение какой-то потусторонней скверны. Так или иначе, теневые воины это единственное, что может выставить орден против мистических созданий.
